import java.util.ArrayList;
import java.util.Collection;
import java.util.Collections;
import java.util.List;

/*
 *Заполнить список названиями планет Солнечной системы в произвольном порядке с повторениями.
 * Меркурий, Венера, Земля, Марс, Юпитер, Сатурн, Уран, Нептун, Плутон.
 * Вывести название каждой планеты и количество его повторений в списке.
 */
public class Main {
    public static void main(String[] args) {
        planets();
    }

    public static List planets() {
        ArrayList<String> listPlanets = new ArrayList<>(List.of("Уран", "Меркурий", "Венера", "Меркурий", "Земля", "Марс", "Юпитер", "Меркурий", "Сатурн", "Юпитер", "Уран", "Нептун", "Плутон", "Венера"));

        //System.out.println(arr[1]);
        int count = 0;
        for (Object num: listPlanets) {
            if
        }

        return null;
    }
}